Revit 2024 API
TransformWithBoundary Constructor
 Constructs a new copy of the input TransformWithBoundary object.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2021
Syntax
C#
public TransformWithBoundary(
	TransformWithBoundary other
)
Visual Basic
Public Sub New ( _
	other As TransformWithBoundary _
)
Visual C++
public:
TransformWithBoundary(
	TransformWithBoundary^ other
)
Parameters
other
Type: Autodesk.Revit.DB.TransformWithBoundary
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentNullException |  A non-optional argument was null
See Also
TransformWithBoundary Class
Autodesk.Revit.DB Namespace